<?php

return [

    /*
    |--------------------------------------------------------------------------
    | メール送信設定
    |--------------------------------------------------------------------------
    */
    'Mail' => [
        'MAIL_FROM_ADDRESS' => 'gr_admin@airily.co.jp',
        'MAIL_FROM_NAME' => 'ガラスリソーシング(株)',
        'MAIL_CC' => 'gr_admin@airily.co.jp' ,           //半角カンマ区切りで複数指定可能
        'MAIL_ADMIN' => 'duyetkaka2110@gmail.com'
    ],

    /*
    |--------------------------------------------------------------------------
    | 依頼申込画面で「依頼」クリック時,ダイアログのメッセージが表示される
    |--------------------------------------------------------------------------
    */
    'CompanyInfo' => [
        'title' => '依頼申込の確認',
        'content' => "依頼申込を行いますか？<br> ※注： 依頼申込後、依頼内容を編集することはできません。 依頼の修正、取消については、以下までご連絡下さい。<br><br>",
        'company' => "ガラスリソーシング株式会社<br>",
        'mail' => '○○○○○○○○@glass-r.com',
        'phone' => '0479-24-6651',
        'fax' => '0479-24-6652',
        'manager' => '○○、○○',
    ],

    /*
    |--------------------------------------------------------------------------
    | 搬入予定データ出力での使用フォルダを指定
    | ※本システムから操作可能なフォルダを指定
    |--------------------------------------------------------------------------
    */
    'CarryInOutputFolder' => '../collect_link/carry',  // 出力先フォルダを指定

    /*
    |--------------------------------------------------------------------------
    | 回収完了データ取込での使用フォルダを指定
    | ※本システムから操作可能なフォルダを指定
    |--------------------------------------------------------------------------
    */
    'FinalStatusInputFolder' => '../collect_link/final',  // 取込元フォルダを指定
    'FinalStatusBackupFolder' => '../collect_link/final_backup',  // バックアップフォルダを指定

    /*
    |--------------------------------------------------------------------------
    | 手配カレンダー画面設定
    |--------------------------------------------------------------------------
    */
    // デフォルト表示期間
    'CalendarLimit' => [
        'length' => 1, // 定数
        'unit' => '月' // 単位（日、週、月のいずれかを指定）
    ],
    // 表示可能な最大期間
    'CalendarMax' => [
        'length' => 2, // 定数
        'unit' => '月' // 単位（日、週、月のいずれかを指定）
    ],
    // 車両マスタの「取引先コード」の絞り込み条件を設定（複数指定する場合は配列で指定）
    'CarWherePDCPCDList' => ['900993'],

    /*
    |--------------------------------------------------------------------------
    | 共通設定
    |--------------------------------------------------------------------------
    */
    // 依頼内容の状態
    'RDStatus' => [
        'TEMP'     => '0000', // 一時
        'RECEPT'   => '1000', // 受付
        'REQUEST'  => '1500', // 依頼
        'DISP'     => '2000', // 配車
        'CUSTOMER' => '3000', // 顧客
        'CONFIRM'  => '4000', // 確定
        'COMP'     => '9999'  // 完了
    ],

    // 搬入予定データの出力対象ステータスを上記の名称でセット（配列で複数指定可能）
    'CarryInOutputStatus' => ['CONFIRM'],

    // 先頭ファイル名とキー項目一覧
    "ListTable" => [
        "PLDTCUSTMMST" => [
            "name" => "取引先マスタ",
            "key" => ["CUSTCD"]
        ],
        "PLDTCUSTTMST" => [
            "name" => "取引先担当者マスタ",
            "key" => ["CUSTCD", "TCSTNO"]
        ],
        "PLDTCUSTKMST" => [
            "name" => "取引先単価マスタ",
            "key" => ["CUSTCD", "BRNDKB", "BRNDCD", "TRFMCD"]
        ],
        "PLDTPDCOSMST" => [
            "name" => "物流費マスタ",
            "key" => ["CUSTCD", "PDCPCD", "SRKBCD", "BRNDKB", "BRNDCD", "PDFMCD"]
        ],
        "PLDTPDDRVMST" => [
            "name" => "運転手マスタ",
            "key" => ["PDCPCD", "PDRVCD"]
        ],
        "PLDTBRINFMST" => [
            "name" => "商品マスタ",
            "key" => ["BRNDCD"]
        ],
        "PLDTPDCARMST" => [
            "name" => "車両マスタ",
            "key" => ["PCARNO", "CIDXNO"]
        ]
    ],

    // CSVファイル形式
    "CSV" => [
        "delimiter" => ",",
        "enclosure" => "'",
        "escape" => "'"
    ]
];
